---
kind: property
id: P:Autodesk.Revit.DB.Architecture.HandRailType.SupportTypeId
source: html/2ac66afd-c996-bb2a-1633-91820a758642.htm
---
# Autodesk.Revit.DB.Architecture.HandRailType.SupportTypeId Property

The support type of the handrail.

## Syntax (C#)
```csharp
public ElementId SupportTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The supportTypeId is not a valid rail support or invalidElementId.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null